Revit 2027 API
ViewPosition.ViewAnchor Property
 Specifies the method by which the view will be positioned on the sheet. Default is set to ViewAnchor.ViewOrigin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewAnchor ViewAnchor { get; set; }
Public Property ViewAnchor As ViewAnchor
	Get
	Set
public:
property ViewAnchor ViewAnchor {
	ViewAnchor get ();
	void set (ViewAnchor value);
}
member ViewAnchor : ViewAnchor with get, set
Property Value
ViewAnchor
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ViewPosition Class
Autodesk.Revit.DB Namespace